clc
disp('Нахождение предела функции (2*x^2-11*x-21)/(x^2-9*x+14)')
syms x
digits(7);     %установить количество значащих цифр результата 
y=(2.*x.^2-11.*x-21)/(x.^2-9.*x+14);
k1=limit(y,x,0);
k1=vpa(k1); %символьное выражение
disp(k1);
k2=limit(y,x,7); 
k2=vpa(k2);
disp(k2);
k3=limit(y,x,7,'left');%в 7 левый
k3=vpa(k3);
disp(k3);
k4=limit(y,x,7,'right');%в 7 правый
k4=vpa(k4);
disp(k4);
t=-5:0.01:5;
z=(2*t.^2-11.*t-21)./(t.^2-9.*t+14);
plot(t,z,'b');
grid on;
legend('(2*x^2-11*x-21)/(x^2-9*x+14)');